 # 1강 데이터 집합 불러오기

In [3]:
import pandas as pd
df = pd.read_csv('gapminder.tsv', sep = '\t')

In [4]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [5]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [6]:
df.shape

(1704, 6)

In [7]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

# 2강 데이터 집합 불러오기

In [10]:
country_df = df['country']
print(type(country_df))

<class 'pandas.core.series.Series'>

In [16]:
country_df.head()
# 시리즈는 데이터프레임의 한 줄이구나

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

## 0. 열 단위로 데이터추출하기

여러개 칼럼을 추출하면 데이터프레임이구나

In [14]:
subset = df[['country','continent','year']]
print(type(subset))

<class 'pandas.core.frame.DataFrame'>

In [15]:
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

## 1. loc 속성으로 행 단위로 데이터 추출하기(index)

### loc는 인덱스 iloc 행의 순서..

In [18]:
df.loc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

In [19]:
df.loc[99]

country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object

In [ ]:
df.loc[-1]
# loc는 -1이 없다. 그럼어케?

In [26]:
number_of_rows = df.shape[0]
last_row_index = number_of_rows - 1
print(df.loc[last_row_index])

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

### loc로 여러줄 가져오기

In [23]:

print(df.loc[[0,99,999]])

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

### loc와 tail의 차이

In [32]:
subset_loc = df.loc[0]
subset_tail = df.tail(n=1)

print(type(subset_loc))

print(type(subset_tail))


#엘오씨는 시리즈 테일은 프레임

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

## 2.  iloc 속성으로 행 데이터 추출하기 (행번호)

In [33]:
df.iloc[1]

country      Afghanistan
continent           Asia
year                1957
lifeExp           30.332
pop              9240934
gdpPercap      820.85303
Name: 1, dtype: object

In [34]:
df.iloc[99]

country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object

In [35]:
df.iloc[-1] ## 행번호로 추출하여 loc와 다르게 맨 마지막 데이터가 출력된다.

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

## 3. 슬라이싱 구문으로 데이터 추출하기

In [41]:
subset = df.loc[ : , [ 'year', 'pop']]
# : 의 의미는 전체를 의미한다
# 로우는 전체다 가져오고 칼람은 이어만 팝만 가져와줘

print(subset)

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [42]:
subset = df.iloc[ : , [2,4,-1]] # 두번쨰 칼럼, 네번쨰칼럼, 마지막칼럼 가져와
print(subset)

      year       pop   gdpPercap
0     1952   8425333  779.445314
1     1957   9240934  820.853030
2     1962  10267083  853.100710
3     1967  11537966  836.197138
4     1972  13079460  739.981106
...    ...       ...         ...
1699  1987   9216418  706.157306
1700  1992  10704340  693.420786
1701  1997  11404948  792.449960
1702  2002  11926563  672.038623
1703  2007  12311143  469.709298

[1704 rows x 3 columns]

#### 만약에 subset = df.loc[ : , [ '2', '4']] 로 하면 오류가 뜸  

2,4(문자)이름으로 된 컬럼이 없기 때문이다. 즉, loc는 추출할 때 컬럼을 인덱스로 부르면 안된다는 뜻, 컬럼 "이름"을 직접 지정해줘야한다.

# 3강 기초적인 통계 계산하기

## 1. 기초 통계? 계산

In [49]:
# 년도별 평균 기대수명 구하기!!

# 시리즈는 [],
# 프레임은 [[]] 으로

df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [57]:
# 연도별로 하는데 대륙별 그룹해서 보고 싶어

df.groupby(['year','continent']).mean().head()

                  lifeExp           pop     gdpPercap
year continent
1952 Africa     39.135500  4.570010e+06   1252.572466
     Americas   53.279840  1.380610e+07   4079.062552
     Asia       46.314394  4.228356e+07   5195.484004
     Europe     64.408500  1.393736e+07   5661.057435
     Oceania    69.255000  5.343003e+06  10298.085650

In [58]:
# 위에서 컬럼 두 가지만 보고 싶어

df.groupby(['year','continent'])[['lifeExp','gdpPercap']].mean().head()

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650

In [56]:
# df.groupby(['year','continent'])[['lifeExp','gdpPercap']].sum() 주로 사용
# df.groupby(['year','continent'])[['lifeExp','gdpPercap']].count() 주로사용
# df.groupby(['year','continent'])[['lifeExp','gdpPercap']].size() 
# df.groupby(['year','continent'])[['lifeExp','gdpPercap']].size() 

# 등등 많음

## 2. 나만의 데이터 만들기

## 2.1 시리즈 직접 만들기

In [59]:
import pandas as pd
s = pd.Series(['banana',42])
print(s)

0    banana
1        42
dtype: object

In [60]:
s = pd.Series(['apple','banana'], index = ['A','B'])

In [61]:
print(s)

A     apple
B    banana
dtype: object

## 2.2 데이터프레임 직접 만들기

In [66]:
# 딕셔너리를 이용하여 df 만들기

In [68]:
people = pd.DataFrame(
    data = { 'job' : ['cook','artist'],
    'Name' : ['Ann', "bob"],
    'job' : ['garbage', 'cook'],
    'died' : ['1996-01-01','1206-01-01'],
    'Age' : [35, 41]
})

print(people)

       job Name        died  Age
0  garbage  Ann  1996-01-01   35
1     cook  bob  1206-01-01   41

## 2.3 데이터프레임에서 시리즈 선택하기(1)

In [71]:
people = pd.DataFrame(
    data = { 'job' : ['cook','artist'],
    'born' : ['1995-01-01','1205-01-01'],
    'died' : ['1996-01-01','1206-01-01'],
    'Age' : [35, 41]},
    index = ['Bob','Ann'],
    columns=['job','born','died','Age']
)

In [72]:
print(people)

        job        born        died  Age
Bob    cook  1995-01-01  1996-01-01   35
Ann  artist  1205-01-01  1206-01-01   41

In [75]:
# loc로 index를 전달하여 시리즈 선택하기
first_row = people.loc['Bob']
print(type(first_row))
print(first_row)

<class 'pandas.core.series.Series'>
job           cook
born    1995-01-01
died    1996-01-01
Age             35
Name: Bob, dtype: object

## 2.4 시리즈와 불린 추출 사용하기

In [80]:
scientists = pd.read_csv('scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [81]:
print(scientists['Age'].max()) # 이건 불린 추출이 아님

90

In [84]:
scientists['Age'] > scientists['Age'].mean() # 평균보다 큰 것만 뽑아줘, 근데 가져오지는 못 하고 판단만 가능한거

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [87]:
scientists[scientists['Age'] > scientists['Age'].mean()] # 데이터프레임 [] 괄호로 묶어서 원하는 조건만 가져오는 걸 불린추출,

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

## 2.5 벡터와 스칼라로 브로드캐스팅 수행하기

In [89]:
print(scientists['Age'] + scientists['Age'] )
print(scientists['Age'] * scientists['Age'] ) # 칼럼대칼럼 연산으로 하나의 컬럼으로 만들겠다, 결과는 시리즈로 나옴
print(scientists['Age'] + 100 )
print(scientists['Age'] * 2 )

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64
0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64
0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

## 2.6 벡터와 스칼라로 브로드캐스팅 수행하기

In [93]:
rev_ages = scientists['Age'].sort_index(ascending=False)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [95]:
rev_ages = scientists['Age'].sort_index() # 아무것도 안넣으면 오름차순
rev_ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

## 2.7 연습문제

In [97]:
# 4 * 4의 랜덤한 2개의 매트릭스를 생성하고 최솟값과 최대값을 이용한 새로운 배열을 생성하기
import numpy as np
a = np.random.rand(4,4)
b = np.random.rand(4,4)

In [99]:
min_matrix = np.minimum(a,b) # 각 두 개의 최소값구하기
max_matrix = np.maximum(a,b) # 각 두 개의 최소값구하기
max_matrix

array([[0.85125294, 0.91792109, 0.8950144 , 0.61474777],
       [0.39832876, 0.36940889, 0.75836325, 0.92640798],
       [0.78543191, 0.43454426, 0.95953723, 0.9489244 ],
       [0.98788569, 0.64296995, 0.88026459, 0.7573572 ]])

In [107]:
# 55의 랜덤 매트릭스 생성하고 매트릭스의 전체합, 전체 평균, 각 열의 합, 각행의 값, 각열의 평균, 각행의 평균 계산하기
mat = np.random.rand(3,5)
mat

array([[0.38564742, 0.19611599, 0.9416152 , 0.98711292, 0.24497431],
       [0.49292224, 0.15965034, 0.63012594, 0.64928643, 0.40699702],
       [0.9997769 , 0.42905193, 0.6235323 , 0.22832509, 0.50487717]])

In [108]:
mat.sum(axis = 1) # 행 기준으로 다 더한다. 그래서 3개 밖에 없음

array([2.75546585, 2.33898197, 2.78556338])

In [110]:
mat.sum(axis = 0) # 열방향으로 더해주기, 열은 5개니까 값도 5개 나온다

array([1.87834657, 0.78481826, 2.19527344, 1.86472443, 1.1568485 ])

In [111]:
# 마미작
data = pd.Series([70,30,80,90], index = ['국','영', '수','과'])

for i in data:
    print(i)

70
30
80
90

In [115]:
# 80점 이상인 놈 출력하고 전체 평균구하기 뭐히시기
# 1번
a = data[data>80]
a

과    90
dtype: int64

In [116]:
b = data[data> data.mean()]
b

국    70
수    80
과    90
dtype: int64

# 5강 데이터 다루고 처리하기

# - 데이터처리하기

## 1. 인덱스 기준(오름차순/내림차순)으로 정렬하기

In [117]:
scientists = pd.read_csv('scientists.csv')
scientists.sort_index(ascending = False) # 내림차순으로 정렬

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

## 2. 특정 칼럼의 값을 기준으로 정렬하기

In [119]:
scientists.sort_values(by = 'Born') # sort_values 임

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
5             John Snow  1813-03-15  1858-06-16   45           Physician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [121]:
scientists.sort_values(by = ['Born','Died']) # 두 개 이상일 떄는 []로 묶기

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
5             John Snow  1813-03-15  1858-06-16   45           Physician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

## 3. 시리즈와 마찬가지로 특정 칼럼에 접근하여 기본적인 통계 연산 가능

In [124]:
scientists['Age'].mean() # sum, min, max, std 등 기본적인 통계함수 사용가능

59.125

## 4. 특정 칼럼의 항목 및 항목 개수를 출력

In [127]:
scientists['Age'].unique() #데이터프레임에 명목형 컬럼의 항목을 출력한다

array([37, 61, 90, 66, 56, 45, 41, 77])

In [128]:
scientists['Age'].value_counts() #데이터프레임에 명목형 컬럼의 항목의 개수를 출력한다.

37    1
61    1
90    1
66    1
56    1
45    1
41    1
77    1
Name: Age, dtype: int64

## 5. 요약통계량을 출력한다(연속형변수만)

In [129]:
scientists.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

## 6. 칼럼 기준으로 데이터 추출

In [131]:
scientists[['Born','Died']]

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16
2  1820-05-12  1910-08-13
3  1867-11-07  1934-07-04
4  1907-05-27  1964-04-14
5  1813-03-15  1858-06-16
6  1912-06-23  1954-06-07
7  1777-04-30  1855-02-23

In [132]:
scientists['Born'][2] # 괄호를 하나만 했을 때는 시리즈로 출력되고, 해당 열의 [?]번째 행을 출력

'1820-05-12'

## 7. loc를 통해 index 접근

In [133]:
scientists.loc[0:2] # 행 인덱스 0에서 2까지의 행을 추출

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [134]:
scientists.loc[0,'Age'] # 0번째 행에 있으면서 칼럼이 'Age'인 것은 무엇이냐,

37

## 8. isin 함수를 이용해서 추출

In [135]:
scientists['Occupation'].isin(['Chemist']) # 칼럼안에 ""이 포함되니~~

0     True
1    False
2    False
3     True
4    False
5    False
6    False
7    False
Name: Occupation, dtype: bool

In [144]:
scientists['Occupation'].isin(['Chemist']) # 불린으로 확인만하기

0     True
1    False
2    False
3     True
4    False
5    False
6    False
7    False
Name: Occupation, dtype: bool

In [142]:
scientists[scientists['Occupation'].isin(['Chemist'])] # 괄호로 묶어줌으로써 데이터프레임으로 생성하기

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist
3        Marie Curie  1867-11-07  1934-07-04   66    Chemist

In [145]:
scientists[~scientists['Occupation'].isin(['Chemist'])] # ~는 조건에 반대되는 값을 출력

                   Name        Born        Died  Age          Occupation
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

## 9. 칼럼을 추가하여 남자는 1, 여자는 0으로 변경

In [147]:
scientists['sex'] = ['male', 'male', 'male', 'male', 'female', 'female', 'female', 'female']
scientists.head()

                   Name        Born        Died  Age    Occupation     sex
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist    male
1        William Gosset  1876-06-13  1937-10-16   61  Statistician    male
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse    male
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist    male
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist  female

In [148]:
scientists['sex(replace)'] = scientists['sex'].replace('male',1).replace('female',0)
scientists.head()

,Name,Born,Died,Age,Occupation,sex,sex(replace)
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,male,1
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,male,1
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,male,1
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,male,1
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,female,0

# - 시리즈와 데이터프레임의 데이터 처리하기

## 1. datetime 자료형 데이터프레임 처리하기

In [149]:
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
print(born_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [150]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [152]:
# 새롭게 만든 데이터형으로 컬럼 만들기
scientists['born_dt'],scientists['died_dt'] = (born_datetime, died_datetime)
scientists

,Name,Born,Died,Age,Occupation,sex,sex(replace),born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,male,1,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,male,1,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,male,1,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,male,1,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,female,0,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,female,0,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,female,0,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,female,0,1777-04-30,1855-02-23

In [153]:
# 산 일 수 구하기(컬럼만들기)

scientists['age_days_dt'] = (scientists['died_dt'] - scientists['born_dt'])
scientists.head()

,Name,Born,Died,Age,Occupation,sex,sex(replace),born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,male,1,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,male,1,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,male,1,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,male,1,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,female,0,1907-05-27,1964-04-14,20777 days

## 2. 데이터프레임 열 삭제하기

In [155]:
scientists_dropped = scientists.drop(['Born', 'Died'], axis =1 ) # axis = 1 은  칼럼기준으로 삭제

In [157]:
scientists_dropped

,Name,Age,Occupation,sex,sex(replace),born_dt,died_dt,age_days_dt
0,Rosaline Franklin,37,Chemist,male,1,1920-07-25,1958-04-16,13779 days
1,William Gosset,61,Statistician,male,1,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,90,Nurse,male,1,1820-05-12,1910-08-13,32964 days
3,Marie Curie,66,Chemist,male,1,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,56,Biologist,female,0,1907-05-27,1964-04-14,20777 days
5,John Snow,45,Physician,female,0,1813-03-15,1858-06-16,16529 days
6,Alan Turing,41,Computer Scientist,female,0,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,77,Mathematician,female,0,1777-04-30,1855-02-23,28422 days

In [159]:
scientists_dropped2 = scientists.drop([0,1], axis = 0) # 행 기준으로 인덱스 0,1 삭제
scientists_dropped2

,Name,Born,Died,Age,Occupation,sex,sex(replace),born_dt,died_dt,age_days_dt
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,male,1,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,male,1,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,female,0,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,female,0,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,female,0,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,female,0,1777-04-30,1855-02-23,28422 days

# 3. Pivoting

In [160]:
data = pd.read_csv("@preprocessing_data_member01.csv", encoding = 'utf-8')
data.head()

,Unnamed: 0,ID,총구매수량_x,기타품목구매비율,수저류구매비율,실링구매비율,용기류구매비율,위생용품구매비율,총구매횟수,총판매액,...,최종주문연도,최종주문월,최종주문일자,최종주문요일,최종주문시간,회원가입일(clean),가입연도,가입월,가입일자,가입요일
0,0,100304734@n,1.0,0.0,0.0,0.0,1.0,0.0,1,103300,...,2019.0,5.0,9.0,Thursday,14.0,2019-05-09 00:00:00,2019.0,5.0,9.0,Thursday
1,1,1003409866@k,62.0,0.0,0.0,0.0,1.0,0.0,18,4303880,...,2019.0,5.0,28.0,Tuesday,16.0,2019-01-07 00:00:00,2019.0,1.0,7.0,Monday
2,2,100381931@n,5.0,0.0,0.0,0.0,0.0,1.0,3,71050,...,2019.0,2.0,10.0,Sunday,21.0,2018-10-31 00:00:00,2018.0,10.0,31.0,Wednesday
3,3,1004498382@k,1.0,0.0,0.0,0.0,1.0,0.0,1,76400,...,2019.0,1.0,9.0,Wednesday,12.0,2019-01-09 00:00:00,2019.0,1.0,9.0,Wednesday
4,4,1004547839@k,4.0,1.0,0.0,0.0,0.0,0.0,1,360800,...,2019.0,1.0,9.0,Wednesday,13.0,2019-01-09 00:00:00,2019.0,1.0,9.0,Wednesday

## 4. Group by

In [164]:
data.groupby("최종주문요일").mean() # 요일에 따라 각 컬럼들의 평균을 살표볼수 있뜸

,Unnamed: 0,총구매수량_x,기타품목구매비율,수저류구매비율,실링구매비율,용기류구매비율,위생용품구매비율,총구매횟수,총판매액,총할인금액,총순수이익,나이,사용가능 적립금,최종주문연도,최종주문월,최종주문일자,최종주문시간,가입연도,가입월,가입일자
최종주문요일,,,,,,,,,,,,,,,,,,,,
Friday,2499.629076,10.061141,0.051624,0.042730,0.022682,0.678976,0.203971,4.135870,579195.828804,72446.820652,233982.812500,38.736413,1928.334239,2018.566576,5.354620,16.702446,13.368207,2018.283967,5.732337,15.373641
Monday,2495.839493,8.737064,0.046187,0.035741,0.020566,0.693520,0.203988,3.842661,501610.190074,60959.112988,186472.761352,38.853221,1737.872228,2018.540655,5.326294,17.298838,13.895459,2018.251320,5.732841,16.237592
Saturday,2093.232227,7.488152,0.054066,0.041265,0.030289,0.670431,0.203934,2.895735,431485.876777,53675.876777,179945.900474,43.341232,2404.085308,2018.431280,5.540284,15.725118,14.402844,2018.184834,5.881517,15.284360
Sunday,1964.855967,9.353909,0.033885,0.047128,0.029239,0.685840,0.203877,3.699588,549632.510288,73619.588477,227644.526749,42.448560,3110.954733,2018.510288,5.502058,16.563786,15.818930,2018.218107,6.074074,16.609053
Thursday,2493.923077,11.770330,0.055440,0.032438,0.014300,0.702081,0.195727,4.484615,701618.560440,86728.285714,299408.346154,39.090110,2019.767033,2018.567033,5.317582,16.318681,13.974725,2018.270330,5.536264,15.535165
Tuesday,2556.313305,10.483906,0.037118,0.047886,0.020552,0.701046,0.193384,4.107296,615232.703863,74307.693133,259204.334764,38.952790,2117.407725,2018.590129,5.360515,17.307940,13.932403,2018.293991,5.759657,15.956009
Wednesday,2513.078307,11.693122,0.047488,0.039762,0.017990,0.690128,0.204642,4.506878,677782.095238,84685.989418,278721.862434,38.987302,2468.191534,2018.569312,5.357672,17.033862,13.628571,2018.265608,5.710053,16.266667

In [163]:
data.groupby("최종주문요일")['총구매횟수'].mean()

최종주문요일
Friday       4.135870
Monday       3.842661
Saturday     2.895735
Sunday       3.699588
Thursday     4.484615
Tuesday      4.107296
Wednesday    4.506878
Name: 총구매횟수, dtype: float64

In [165]:
data.groupby("최종주문요일")['총구매횟수'].sum()

최종주문요일
Friday       3044
Monday       3639
Saturday      611
Sunday        899
Thursday     4081
Tuesday      3828
Wednesday    4259
Name: 총구매횟수, dtype: int64

In [167]:
data.groupby(["최종주문요일",'성별'])['총구매횟수'].sum()

최종주문요일     성별
Friday     남자    2222
           여자     822
Monday     남자    2940
           여자     699
Saturday   남자     527
           여자      84
Sunday     남자     689
           여자     210
Thursday   남자    3188
           여자     893
Tuesday    남자    3124
           여자     704
Wednesday  남자    3335
           여자     924
Name: 총구매횟수, dtype: int64

### 그룹바이만 해도 핵심적인 인사이트를 확인할 수 있다,.

## 5. Pivot Table

In [168]:
pd.pivot_table(data = data , index = '최종주문요일', values = '총구매횟수')

              총구매횟수
최종주문요일
Friday     4.135870
Monday     3.842661
Saturday   2.895735
Sunday     3.699588
Thursday   4.484615
Tuesday    4.107296
Wednesday  4.506878